name: "C3D-t1"
mem_param {
  optimize_test: true
  optimize_train: true
}
########################################### data #############################################
layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "train_rgb_final.txt"
    batch_size: 8
    new_width: 340
    new_height: 256
    new_length: 32
    num_segments: 1
    modality: RGB
    length_first: true
    name_pattern: "image_%05d.jpg"
    shuffle: true
  }
  transform_param {
    crop_size: 224
    mirror: true
    multi_scale: true
    max_distort: 1
    scale_ratios: [1, 0.875, 0.75, 0.66]
    mean_value: [104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104]
    mean_value: [117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117]
    mean_value: [123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123]
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "val_rgb_final.txt"
    batch_size: 1
    new_length: 32
    new_width: 240
    new_height: 256
    num_segments: 1
    modality: RGB
    name_pattern: "image_%05d.jpg"
    length_first: true
  }
  transform_param {
    crop_size: 224
    mirror: false
    mean_value: [104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104]
    mean_value: [117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117]
    mean_value: [123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123, 123]
  }
  include: { phase: TEST }
}
layer {
  name: "data_reshape"
  type: "Reshape"
  bottom: "data"
  top: "data_reshape"
  reshape_param{
    shape { dim: -1 dim: 3 dim: 32 dim: 224 dim: 224 } 
  }
}

############################################# energy1 ########################################
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data_reshape"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: [0, 3, 3]
    kernel_size: [1, 7, 7]
    stride: [2, 2, 2]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer { 
  name: "conv1_bn" type: "BN" bottom: "conv1" top: "conv1_bn"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "conv1_t"
  type: "Convolution"
  bottom: "data_reshape"
  top: "conv1_t"
  convolution_param {
    num_output: 64
    pad: [1, 3, 3]
    kernel_size: [3, 7, 7]
    stride: [2, 2, 2]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer { 
  name: "conv1_t_bn" type: "BN" bottom: "conv1_t" top: "conv1_t_bn"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "energy1"
  bottom: "conv1_t_bn"
  top: "energy1"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling1"
  bottom: "energy1"
  top: "pooling1"
  type: "Convolution"
  convolution_param {
    num_output: 32
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 32
  }
  param { lr_mult: 0 decay_mult: 0 }
}
layer {
  name: "pooling1_bn"
  bottom: "pooling1"
  top: "pooling1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "concat1"
  bottom: "conv1_bn"
  bottom: "pooling1_bn"
  top: "concat1"
  type: "Concat"
}
layer {
  name: "concat1_relu"
  bottom: "concat1"
  top: "concat1"
  type: "ReLU"
}
layer {
  name: "redu1"
  bottom: "concat1"
  top: "redu1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "redu1_bn"
  bottom: "redu1"
  top: "redu1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "redu1_relu"
  bottom: "redu1_bn"
  top: "redu1_bn"
  type: "ReLU"
}
############################################## pool-extra ##########################################
layer {
  name: "pooling1-extra"
  bottom: "redu1_bn"
  top: "pooling1-extra"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [2, 2, 2]
    weight_filler{
       type: "constant"
       value: 0
    }
    bias_term: false
    group: 64
  }
  param { lr_mult: 0 decay_mult: 0 }
}
layer {
  name: "pooling1-extra_bn"
  bottom: "pooling1-extra"
  top: "pooling1-extra_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}

############################################## res2a ##########################################
layer {
  name: "res2a_1"
  bottom: "pooling1-extra_bn"
  top: "res2a_1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2a_1_bn"
  bottom: "res2a_1"
  top: "res2a_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 }	bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "res2a_1_relu"
  bottom: "res2a_1_bn"
  top: "res2a_1_bn"
  type: "ReLU"
}
layer {
  name: "res2a_2"
  bottom: "res2a_1_bn"
  top: "res2a_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2a_2_bn"
  top: "res2a_2_bn"
  bottom: "res2a_2"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } }
}
layer {
  name: "res2a_2_t"
  bottom: "res2a_1_bn"
  top: "res2a_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2a_2_t_bn"
  top: "res2a_2_t_bn"
  bottom: "res2a_2_t"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } }
}
layer {
  name: "energy2"
  bottom: "res2a_2_t_bn"
  top: "energy2"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling2"
  bottom: "energy2"
  top: "pooling2"
  type: "Convolution"
  convolution_param {
    num_output: 32
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 32
  }
  param { lr_mult: 0 decay_mult: 0 }
}
layer {
  name: "pooling2_bn"
  bottom: "pooling2"
  top: "pooling2_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "concat2"
  bottom: "res2a_2_bn"
  bottom: "pooling2_bn"
  top: "concat2"
  type: "Concat"
}
layer {
  name: "concat2_relu"
  bottom: "concat2"
  top: "concat2"
  type: "ReLU"
}
layer {
  name: "redu2"
  bottom: "concat2"
  top: "redu2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2a"
  bottom: "pooling1-extra"
  bottom: "redu2"
  top: "res2a"
  type: "Eltwise"
}
layer {
  name: "res2a_bn"
  bottom: "res2a"
  top: "res2a_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "res2a_relu"
  bottom: "res2a_bn"
  top: "res2a_bn"
  type: "ReLU"
}
########################################## res2b ###############################
layer {
  name: "res2b_1"
  bottom: "res2a_bn"
  top: "res2b_1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2b_1_bn"
  bottom: "res2b_1"
  top: "res2b_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "res2b_1_relu"
  bottom: "res2b_1_bn"
  top: "res2b_1_bn"
  type: "ReLU"
}
layer {
  name: "res2b_2"
  bottom: "res2b_1_bn"
  top: "res2b_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2b_2_bn"
  bottom: "res2b_2"
  top: "res2b_2_bn"
  type: "BN" 
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res2b_2_t"
  bottom: "res2b_1_bn"
  top: "res2b_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2b_2_t_bn"
  bottom: "res2b_2_t"
  top: "res2b_2_t_bn"
  type: "BN" 
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "energy3"
  bottom: "res2b_2_t_bn"
  top: "energy3"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling3"
  bottom: "energy3"
  top: "pooling3"
  type: "Convolution"
  convolution_param {
    num_output: 32
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 32
  }
  param { lr_mult: 0 decay_mult: 0 } 
}
layer {
  name: "pooling3_bn"
  bottom: "pooling3"
  top: "pooling3_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {  
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "concat3"
  bottom: "res2b_2_bn"
  bottom: "pooling3_bn"
  top: "concat3"
  type: "Concat"
}
layer {
  name: "concat3_relu"
  bottom: "concat3"
  top: "concat3"
  type: "ReLU"
}
layer {
  name: "redu3"
  bottom: "concat3"
  top: "redu3"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2b"
  bottom: "res2a"
  bottom: "redu3"
  top: "res2b"
  type: "Eltwise"
}
layer {
  name: "res2b_bn"
  bottom: "res2b"
  top: "res2b_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "res2b_relu"
  bottom: "res2b_bn"
  top: "res2b_bn"
  type: "ReLU"
}
########################################## res2c ###############################
layer {
  name: "res2c_1"
  bottom: "res2b_bn"
  top: "res2c_1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2c_1_bn"
  bottom: "res2c_1"
  top: "res2c_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "res2c_1_relu"
  bottom: "res2c_1_bn"
  top: "res2c_1_bn"
  type: "ReLU"
}
layer {
  name: "res2c_2"
  bottom: "res2c_1_bn"
  top: "res2c_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2c_2_bn"
  bottom: "res2c_2"
  top: "res2c_2_bn"
  type: "BN" 
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res2c_2_t"
  bottom: "res2c_1_bn"
  top: "res2c_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2c_2_t_bn"
  bottom: "res2c_2_t"
  top: "res2c_2_t_bn"
  type: "BN" 
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "energy3-c"
  bottom: "res2c_2_t_bn"
  top: "energy3-c"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling3-c"
  bottom: "energy3-c"
  top: "pooling3-c"
  type: "Convolution"
  convolution_param {
    num_output: 32
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 32
  }
  param { lr_mult: 0 decay_mult: 0 } 
}
layer {
  name: "pooling3-c_bn"
  bottom: "pooling3-c"
  top: "pooling3-c_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {  
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "concat3-c"
  bottom: "res2c_2_bn"
  bottom: "pooling3-c_bn"
  top: "concat3-c"
  type: "Concat"
}
layer {
  name: "concat3-c_relu"
  bottom: "concat3-c"
  top: "concat3-c"
  type: "ReLU"
}
layer {
  name: "redu3-c"
  bottom: "concat3-c"
  top: "redu3-c"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_term: false
  }
  param { lr_mult: 1 decay_mult: 1 }
}
layer {
  name: "res2c"
  bottom: "res2b"
  bottom: "redu3-c"
  top: "res2c"
  type: "Eltwise"
}
layer {
  name: "res2c_bn"
  bottom: "res2c"
  top: "res2c_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } 
}
layer {
  name: "res2c_relu"
  bottom: "res2c_bn"
  top: "res2c_bn"
  type: "ReLU"
}

########################################### Res3a ##########################################
layer {
  name: "res3a_1"
  bottom: "res2c_bn"
  top: "res3a_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [2, 2, 2]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3a_1_bn"
  bottom: "res3a_1"
  top: "res3a_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
	slope_filler { type: "constant" value: 1 } 
	bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res3a_1_relu"
  bottom: "res3a_1_bn"
  top: "res3a_1_bn"
  type: "ReLU"
}
layer {
  name: "res3a_2"
  bottom: "res3a_1_bn"
  top: "res3a_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3a_2_bn"
  bottom: "res3a_2"
  top: "res3a_2_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "res3a_2_t"
  bottom: "res3a_1_bn"
  top: "res3a_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3a_2_t_bn"
  bottom: "res3a_2_t"
  top: "res3a_2_t_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "energy4"
  bottom: "res3a_2_t_bn"
  top: "energy4"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling4"
  bottom: "energy4"
  top: "pooling4"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 64
  }
  param { lr_mult: 0 decay_mult: 0 } 
}
layer {
  name: "pooling4_bn"
  bottom: "pooling4"
  top: "pooling4_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {  
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "concat4"
  bottom: "res3a_2_bn"
  bottom: "pooling4_bn"
  top: "concat4"
  type: "Concat"
}
layer {
  name: "concat4_relu"
  bottom: "concat4"
  top: "concat4"
  type: "ReLU"
}
layer {
  name: "redu4"
  bottom: "concat4"
  top: "redu4"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3a_down"
  type: "Convolution"
  bottom: "res2c_bn"
  top: "res3a_down"
  convolution_param {
    num_output: 128
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [2, 2, 2]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3a"
  bottom: "redu4"
  bottom: "res3a_down"
  top: "res3a"
  type: "Eltwise"
}
layer {
  name: "res3a_bn"
  bottom: "res3a"
  top: "res3a_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
	slope_filler { type: "constant" value: 1 } 
	bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res3a_relu"
  bottom: "res3a_bn"
  top: "res3a_bn"
  type: "ReLU"
}
############################################ Res3b ####################################
layer {
  name: "res3b_1"
  bottom: "res3a_bn"
  top: "res3b_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3b_1_bn"
  bottom: "res3b_1"
  top: "res3b_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
	slope_filler { type: "constant" value: 1 } 
	bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res3b_1_relu"
  bottom: "res3b_1_bn"
  top: "res3b_1_bn"
  type: "ReLU"
}
layer {
  name: "res3b_2"
  bottom: "res3b_1_bn"
  top: "res3b_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3b_2_bn"
  bottom: "res3b_2"
  top: "res3b_2_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "res3b_2_t"
  bottom: "res3b_1_bn"
  top: "res3b_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3b_2_t_bn"
  bottom: "res3b_2_t"
  top: "res3b_2_t_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "energy5"
  bottom: "res3b_2_t_bn"
  top: "energy5"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling5"
  bottom: "energy5"
  top: "pooling5"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 64
  }
  param { lr_mult: 0 decay_mult: 0 }
}
layer {
  name: "pooling5_bn"
  bottom: "pooling5"
  top: "pooling5_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {  
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "concat5"
  bottom: "res3b_2_bn"
  bottom: "pooling5_bn"
  top: "concat5"
  type: "Concat"
}
layer {
  name: "concat5_relu"
  bottom: "concat5"
  top: "concat5"
  type: "ReLU"
}
layer {
  name: "redu5"
  bottom: "concat5"
  top: "redu5"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3b"
  bottom: "redu5"
  bottom: "res3a"
  top: "res3b"
  type: "Eltwise"
}
layer {
  name: "res3b_bn"
  bottom: "res3b"
  top: "res3b_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
	slope_filler { type: "constant" value: 1 } 
	bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res3b_relu"
  bottom: "res3b_bn"
  top: "res3b_bn"
  type: "ReLU"
}
############################################ Res3c ####################################
layer {
  name: "res3c_1"
  bottom: "res3b_bn"
  top: "res3c_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3c_1_bn"
  bottom: "res3c_1"
  top: "res3c_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
  slope_filler { type: "constant" value: 1 } 
  bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res3c_1_relu"
  bottom: "res3c_1_bn"
  top: "res3c_1_bn"
  type: "ReLU"
}
layer {
  name: "res3c_2"
  bottom: "res3c_1_bn"
  top: "res3c_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3c_2_bn"
  bottom: "res3c_2"
  top: "res3c_2_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "res3c_2_t"
  bottom: "res3c_1_bn"
  top: "res3c_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3c_2_t_bn"
  bottom: "res3c_2_t"
  top: "res3c_2_t_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "energy5-c"
  bottom: "res3c_2_t_bn"
  top: "energy5-c"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling5-c"
  bottom: "energy5-c"
  top: "pooling5-c"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 64
  }
  param { lr_mult: 0 decay_mult: 0 }
}
layer {
  name: "pooling5-c_bn"
  bottom: "pooling5-c"
  top: "pooling5-c_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {  
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "concat5-c"
  bottom: "res3c_2_bn"
  bottom: "pooling5-c_bn"
  top: "concat5-c"
  type: "Concat"
}
layer {
  name: "concat5-c_relu"
  bottom: "concat5-c"
  top: "concat5-c"
  type: "ReLU"
}
layer {
  name: "redu5-c"
  bottom: "concat5-c"
  top: "redu5-c"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3c"
  bottom: "redu5-c"
  bottom: "res3b"
  top: "res3c"
  type: "Eltwise"
}
layer {
  name: "res3c_bn"
  bottom: "res3c"
  top: "res3c_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
  slope_filler { type: "constant" value: 1 } 
  bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res3c_relu"
  bottom: "res3c_bn"
  top: "res3c_bn"
  type: "ReLU"
}
############################################ Res3d ####################################
layer {
  name: "res3d_1"
  bottom: "res3c_bn"
  top: "res3d_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3d_1_bn"
  bottom: "res3d_1"
  top: "res3d_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
  slope_filler { type: "constant" value: 1 } 
  bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res3d_1_relu"
  bottom: "res3d_1_bn"
  top: "res3d_1_bn"
  type: "ReLU"
}
layer {
  name: "res3d_2"
  bottom: "res3d_1_bn"
  top: "res3d_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3d_2_bn"
  bottom: "res3d_2"
  top: "res3d_2_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "res3d_2_t"
  bottom: "res3d_1_bn"
  top: "res3d_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3d_2_t_bn"
  bottom: "res3d_2_t"
  top: "res3d_2_t_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "energy5-d"
  bottom: "res3d_2_t_bn"
  top: "energy5-d"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling5-d"
  bottom: "energy5-d"
  top: "pooling5-d"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 64
  }
  param { lr_mult: 0 decay_mult: 0 }
}
layer {
  name: "pooling5-d_bn"
  bottom: "pooling5-d"
  top: "pooling5-d_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {  
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "concat5-d"
  bottom: "res3d_2_bn"
  bottom: "pooling5-d_bn"
  top: "concat5-d"
  type: "Concat"
}
layer {
  name: "concat5-d_relu"
  bottom: "concat5-d"
  top: "concat5-d"
  type: "ReLU"
}
layer {
  name: "redu5-d"
  bottom: "concat5-d"
  top: "redu5-d"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res3d"
  bottom: "redu5-d"
  bottom: "res3c"
  top: "res3d"
  type: "Eltwise"
}
layer {
  name: "res3d_bn"
  bottom: "res3d"
  top: "res3d_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
  slope_filler { type: "constant" value: 1 } 
  bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res3d_relu"
  bottom: "res3d_bn"
  top: "res3d_bn"
  type: "ReLU"
}

######################################### res4a #################################################
layer {
  name: "res4a_1"
  bottom: "res3d_bn"
  top: "res4a_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [2, 2, 2]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4a_1_bn"
  bottom: "res4a_1"
  top: "res4a_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
	slope_filler { type: "constant" value: 1 } 
	bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res4a_1_relu"
  bottom: "res4a_1_bn"
  top: "res4a_1_bn"
  type: "ReLU"
}
layer {
  name: "res4a_2"
  bottom: "res4a_1_bn"
  top: "res4a_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4a_2_bn"
  bottom: "res4a_2"
  top: "res4a_2_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "res4a_2_t"
  bottom: "res4a_1_bn"
  top: "res4a_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4a_2_t_bn"
  bottom: "res4a_2_t"
  top: "res4a_2_t_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "energy6"
  bottom: "res4a_2_t_bn"
  top: "energy6"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling6"
  bottom: "energy6"
  top: "pooling6"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 128
  }
  param { lr_mult: 0 decay_mult: 0 }
}
layer {
  name: "pooling6_bn"
  bottom: "pooling6"
  top: "pooling6_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {  
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "concat6"
  bottom: "res4a_2_bn"
  bottom: "pooling6_bn"
  top: "concat6"
  type: "Concat"
}
layer {
  name: "concat6_relu"
  bottom: "concat6"
  top: "concat6"
  type: "ReLU"
}
layer {
  name: "redu6"
  bottom: "concat6"
  top: "redu6"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}

layer {
  name: "res4a_down"
  bottom: "res3d_bn"
  top: "res4a_down"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [2, 2, 2]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4a"
  bottom: "redu6"
  bottom: "res4a_down"
  top: "res4a"
  type: "Eltwise"
}
layer {
  name: "res4a_bn"
  bottom: "res4a"
  top: "res4a_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
	slope_filler { type: "constant" value: 1 } 
	bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res4a_relu"
  bottom: "res4a_bn"
  top: "res4a_bn"
  type: "ReLU"
}
################################################ Res4b ###########################################################
layer {
  name: "res4b_1"
  bottom: "res4a_bn"
  top: "res4b_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4b_1_bn"
  bottom: "res4b_1"
  top: "res4b_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
	slope_filler { type: "constant" value: 1 } 
	bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res4b_1_relu"
  bottom: "res4b_1_bn"
  top: "res4b_1_bn"
  type: "ReLU"
}
layer {
  name: "res4b_2"
  bottom: "res4b_1_bn"
  top: "res4b_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4b_2_bn"
  bottom: "res4b_2"
  top: "res4b_2_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "res4b_2_t"
  bottom: "res4b_1_bn"
  top: "res4b_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4b_2_t_bn"
  bottom: "res4b_2_t"
  top: "res4b_2_t_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "energy7"
  bottom: "res4b_2_t_bn"
  top: "energy7"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling7"
  bottom: "energy7"
  top: "pooling7"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 128
  }
  param { lr_mult: 0 decay_mult: 0 }
}
layer {
  name: "pooling7_bn"
  bottom: "pooling7"
  top: "pooling7_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {  
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "concat7"
  bottom: "res4b_2_bn"
  bottom: "pooling7_bn"
  top: "concat7"
  type: "Concat"
}
layer {
  name: "concat7_relu"
  bottom: "concat7"
  top: "concat7"
  type: "ReLU"
}
layer {
  name: "redu7"
  bottom: "concat7"
  top: "redu7"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}

layer {
  name: "res4b"
  bottom: "redu7"
  bottom: "res4a"
  top: "res4b"
  type: "Eltwise"
}
layer {
  name: "res4b_bn"
  bottom: "res4b"
  top: "res4b_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
	slope_filler { type: "constant" value: 1 } 
	bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res4b_relu"
  top: "res4b_bn"
  bottom: "res4b_bn"
  type: "ReLU"
}
########################fuszhu classify########################
######################################### Global pool ############################################################
layer {
  name: "global_pool_pre"
  bottom: "res4b_bn"
  top: "global_pool_pre"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: [1, 14, 14]
    stride: [1, 1, 1]
  }
}
layer {
  name: "global_pool_reshape_pre"
  type: "Reshape"
  bottom: "global_pool_pre"
  top: "global_pool_reshape_pre"
  reshape_param { shape { dim: -1 dim: 512 } }
}
layer {
  name: "dropout_pre"
  type: "Dropout"
  bottom: "global_pool_reshape_pre"
  top: "global_pool_reshape_pre"
  dropout_param { dropout_ratio: 0.1 }
}
########################################## FC #######################################
layer {
  name: "fc8_pre"
  type: "InnerProduct"
  bottom: "global_pool_reshape_pre"
  top: "fc8_pre"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fc8_pre"
  bottom: "label"
  top: "loss_pre"
  name: "loss_pre"
  type: "SoftmaxWithLoss"
  loss_weight: 0.3
}
layer {
  bottom: "fc8_pre"
  top: "loss_pre_prob"
  name: "loss_pre_prob"
  type: "Softmax"
  include {
    phase: TEST
  }
}
layer {
  bottom: "loss_pre_prob"
  bottom: "label"
  top: "loss_pre/top-1"
  name: "loss_pre/top-1"
  type: "Accuracy"
  include {
    phase: TEST
  }
}

################################################ Res4c ###########################################################
layer {
  name: "res4c_1"
  bottom: "res4b_bn"
  top: "res4c_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4c_1_bn"
  bottom: "res4c_1"
  top: "res4c_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
  slope_filler { type: "constant" value: 1 } 
  bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res4c_1_relu"
  bottom: "res4c_1_bn"
  top: "res4c_1_bn"
  type: "ReLU"
}
layer {
  name: "res4c_2"
  bottom: "res4c_1_bn"
  top: "res4c_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4c_2_bn"
  bottom: "res4c_2"
  top: "res4c_2_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "res4c_2_t"
  bottom: "res4c_1_bn"
  top: "res4c_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4c_2_t_bn"
  bottom: "res4c_2_t"
  top: "res4c_2_t_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "energy7-c"
  bottom: "res4c_2_t_bn"
  top: "energy7-c"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling7-c"
  bottom: "energy7-c"
  top: "pooling7-c"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 128
  }
  param { lr_mult: 0 decay_mult: 0 }
}
layer {
  name: "pooling7-c_bn"
  bottom: "pooling7-c"
  top: "pooling7-c_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {  
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "concat7-c"
  bottom: "res4c_2_bn"
  bottom: "pooling7-c_bn"
  top: "concat7-c"
  type: "Concat"
}
layer {
  name: "concat7-c_relu"
  bottom: "concat7-c"
  top: "concat7-c"
  type: "ReLU"
}
layer {
  name: "redu7-c"
  bottom: "concat7-c"
  top: "redu7-c"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}

layer {
  name: "res4c"
  bottom: "redu7-c"
  bottom: "res4b"
  top: "res4c"
  type: "Eltwise"
}
layer {
  name: "res4c_bn"
  bottom: "res4c"
  top: "res4c_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
  slope_filler { type: "constant" value: 1 } 
  bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res4c_relu"
  top: "res4c_bn"
  bottom: "res4c_bn"
  type: "ReLU"
}
################################################ Res4d ###########################################################
layer {
  name: "res4d_1"
  bottom: "res4c_bn"
  top: "res4d_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4d_1_bn"
  bottom: "res4d_1"
  top: "res4d_1_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param { 
    frozen: false 
  slope_filler { type: "constant" value: 1 } 
  bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "res4d_1_relu"
  bottom: "res4d_1_bn"
  top: "res4d_1_bn"
  type: "ReLU"
}
layer {
  name: "res4d_2"
  bottom: "res4d_1_bn"
  top: "res4d_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [0, 1, 1]
    kernel_size: [1, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4d_2_bn"
  bottom: "res4d_2"
  top: "res4d_2_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "res4d_2_t"
  bottom: "res4d_1_bn"
  top: "res4d_2_t"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [1, 1, 1]
    kernel_size: [3, 3, 3]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
       value: 0
    }
  }
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
}
layer {
  name: "res4d_2_t_bn"
  bottom: "res4d_2_t"
  top: "res4d_2_t_bn"
  type: "BN"
   param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    frozen: false
        slope_filler { type: "constant" value: 1 }
        bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "energy7-d"
  bottom: "res4d_2_t_bn"
  top: "energy7-d"
  type: "Power"
  power_param { power: 2 scale: 1 shift: 0 }
}
layer {
  name: "pooling7-d"
  bottom: "energy7-d"
  top: "pooling7-d"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "constant"
       value: 0.5
    }
    bias_term: false
    group: 128
  }
  param { lr_mult: 0 decay_mult: 0 }
}
layer {
  name: "pooling7-d_bn"
  bottom: "pooling7-d"
  top: "pooling7-d_bn"
  type: "BN"
  param { lr_mult: 1 decay_mult: 0 } param { lr_mult: 1 decay_mult: 0 }
  bn_param {  
    slope_filler { type: "constant" value: 1 } 
    bias_filler { type: "constant" value: 0 } 
  } 
}
layer {
  name: "concat7-d"
  bottom: "res4d_2_bn"
  bottom: "pooling7-d_bn"
  top: "concat7-d"
  type: "Concat"
}
layer {
  name: "concat7-d_relu"
  bottom: "concat7-d"
  top: "concat7-d"
  type: "ReLU"
}
layer {
  name: "redu7-d"
  bottom: "concat7-d"
  top: "redu7-d"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: [0, 0, 0]
    kernel_size: [1, 1, 1]
    stride: [1, 1, 1]
    weight_filler{
       type: "xavier"
    }
    bias_filler{
       type: "constant"
